const age = +prompt("Ваш рік народження");
const city = prompt("В якому місті ви живете? e.g. Київ, Лондон, Вашингтон");
const sport = prompt("Який ваш улюблений вид спорту? e.g. Бокс, Футбол, Баскетбол")

if (age<0 || age>2023){
    alert("Невірно введено ваш вік");
} else if (age ==""){
    alert("Шкода, що Ви не захотіли ввести свій рік народження")
} else if (city ==""){
    alert("Шкода, що Ви не захотіли ввести своє місто")
} else if (sport ==""){
    alert("Шкода, що Ви не захотіли ввести свій улюблений вид спорту")
}
else if (age>0 && city === 'Київ'){
    const result = 2023 - (age);
    alert("Вам " +result+ " років і Ви живете у столиці України"); 
} else if (age>0 && city === 'Лондон'){
    const result = 2023 - (age);
    alert("Вам " +result+ " років і Ви живете у столиці Англії");
} else if (age>0 && city === 'Вашингтон'){
    const result = 2023 - (age);
    alert("Вам " +result+ " років і Ви живете у столиці США");
} else if (city != 'Київ', 'Лондон', 'Вашингтон'){
    const result = 2023 - (age);
    alert("Вам " +result+ " років і Ви живете в " +city);
} 

if (sport==='Бокс'){
    alert("Круто! Хочеш стати як Майк Тайсон?")
}else if (sport==='Футбол'){
    alert("Круто! Хочеш стати як Мессі?")
}else if (sport==='Баскетбол'){
    alert("Круто! Хочеш стати як Майкл Джордан?")
}